In [120]:
import numpy as np
import pandas as pd
import re

In [141]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [142]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [143]:
df['FlightNumber']=[(10045+(10*k)) for k in range(5)]

In [144]:
colheads=(df.columns[0]).split("_")

In [145]:
colheads

['From', 'To']

In [146]:
fromval=[]
toval=[]
for i in range(len(df)):
    vals=df['From_To'][i]
    li=vals.split("_")
    fromval.append(li[0])
    toval.append(li[1])

In [147]:
for i in range(len(df)):
    fromval[i]=fromval[i].capitalize()
    toval[i]=toval[i].capitalize()

In [148]:
fromval

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [149]:
toval

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [150]:
for i in range(len(df)):
    df[colheads[0]]=[i for i in fromval]
    df[colheads[1]]=[j for j in toval]

In [151]:
l=0
for i in range(len(df)):
    if len(df['RecentDelays'][i])>l:
        l=len(df['RecentDelays'][i])

In [152]:
l

3

In [153]:
heading=['Delay_1','Delay_2','Delay_3']

In [154]:
data=[[np.NaN]*3 for _ in range(5)]

In [155]:
delaydf=pd.DataFrame(data=data,columns=heading)

In [156]:
for i in range(len(df)):
    l=len(df['RecentDelays'][i])
    for j in range(l):
        data[i][j]=df['RecentDelays'][i][j]

In [157]:
delaydf=pd.DataFrame(data=data,columns=heading)

In [158]:
delaydf

   Delay_1  Delay_2  Delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [159]:
df=pd.concat([df,delaydf],axis=1)

In [160]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To,Delay_1,Delay_2,Delay_3
0,LoNDon_paris,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,MAdrid_miLAN,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [161]:
for i in range(len(df)):
    df['Airline'][i]=re.sub('[^A-Za-z\s]+', '',str(df['Airline'][i]))

C:\Users\Adhil E\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [162]:
df.drop(['From_To','RecentDelays'],axis=1)

,FlightNumber,Airline,From,To,Delay_1,Delay_2,Delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

In [163]:
df=df[['From','To','FlightNumber','Airline','Delay_1','Delay_2','Delay_3']]

In [164]:
df

,From,To,FlightNumber,Airline,Delay_1,Delay_2,Delay_3
0,London,Paris,10045,KLM,23.0,47.0,NaN
1,Madrid,Milan,10055,Air France,NaN,NaN,NaN
2,London,Stockholm,10065,British Airways,24.0,43.0,87.0
3,Budapest,Paris,10075,Air France,13.0,NaN,NaN
4,Brussels,London,10085,Swiss Air,67.0,32.0,NaN